Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration class centralizes all configuration options for graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.DimensionCurveTypes
The dimension curve types.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.dimensionTextColor
The dimension text color in TS model view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration class.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetColor(Tekla.BIM.DirectManipulation.Services.Graphics.CurveType)
Returns the environment specific color for the given curve type.
curveType: The curve type.
Returns: The environment specific color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetColor(Tekla.BIM.DirectManipulation.Services.Graphics.FaceType)
Returns the environment specific color for the given face type.
faceType: The face type.
Returns: The environment specific color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetColor(Tekla.BIM.DirectManipulation.Services.Graphics.TextType)
Returns the environment specific color for the given text type.
textType: The text type.
Returns: The environment specific color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetColor(Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic,System.Nullable{Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState})
Returns the environment specific color for the given text graphic.
text: The text graphic.
state: The interaction state.
Returns: The environment specific color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetBackgroundColor(Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic,System.Nullable{Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState})
Gets the background color for the text.
text: The text graphic.
state: The interaction state.
Returns: The background color for the text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetFormattedString(Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic)
Gets the Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic.Text value as a formatted string which can be printed as a graphic to the view.
text: The Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic to get a formatted string for.
Returns: The formatted string.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetLineWidth(Tekla.BIM.DirectManipulation.Services.Graphics.CurveType)
Returns the environment specific line width for the given curve type.
curveType: The curve type to be used.
Returns: The environment specific line width.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetLineType(Tekla.BIM.DirectManipulation.Services.Graphics.CurveType)
Returns the environment specific line type for the given curve type.
curveType: The curve type to be used.
Returns: The environment specific line type.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.GetUseSecondaryColor(Tekla.BIM.DirectManipulation.Services.Graphics.CurveType)
Returns the environment specific use secondary color flag for the given curve type.
curveType: The curve type.
Returns: The use secondary color flag.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.UpdateTextColor
Updates the text color configuration based on TS's advanced option for dimensional text color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.IsDimension(Tekla.BIM.DirectManipulation.Services.Graphics.LineGraphic)
Determines whether the specified graphic is dimension.
graphic: The graphic.
Returns: true if the specified graphic is dimension; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.DotExportFormatQuantityValue(System.Double,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType,Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData@)
Formats a quantity value to a System.String.
value: The value to format.
quantityType: The type of quantity represented by value.
argument: The structure that will contain the formatted string.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsConfiguration.ToQuantityType(Tekla.BIM.DirectManipulation.Services.Graphics.TextType)
Converts a Tekla.BIM.DirectManipulation.Services.Graphics.TextType to a Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType value.
textType: The Tekla.BIM.DirectManipulation.Services.Graphics.TextType to convert.
Returns: The matching Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType value; or Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType.None if no better match is available.